Week10/C_PipeFlowWithPorousHeatGeneratingZone/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     buoyantPimpleFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         5;

deltaT          0.00001;

writeControl    adjustableRunTime;

writeInterval   0.1;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

adjustTimeStep  yes;

maxCo           0.75;

functions
{
    probes
    {
        type            probes;
        libs            ("libsampling.so");
        writeControl   timeStep;
        writeInterval  1;
        probeLocations
        (
            (0.05 0.05 0.1)
            (0.05 0.05 0.2)
            (0.05 0.05 0.3)
            (0.05 0.05 0.4)
            (0.05 0.05 0.45)
            (0.05 0.05 0.48)
        );
        fixedLocations  false;
        fields
        (
            T
        );
    }
}


// ************************************************************************* //
