Week10/C_PipeFlowWithPorousHeatGeneratingZone/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (0 0 0) //0
    (0.1 0 0) //1
    (0.1 0.1 0) //2
    (0 0.1 0) //3
    (0 0 0.5) //4
    (0.1 0 0.5) //5
    (0.1 0.1 0.5) //6
    (0 0.1 0.5) //7
);

blocks
(
      hex (0 1 2 3 4 5 6 7) (10 10 50) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    inlet
    {
        type wall;
        faces
        (
            (3 2 1 0)
        );  
    }

    outlet
    {
        type wall;
        faces
        (
            (5 6 7 4)
        );  
    }
    defaultFaces
    {
        type wall;
        faces
        (
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
