Week10/C_PipeFlowWithPorousHeatGeneratingZone/constant/fvOptions
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      fvOptions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

energySource
{
    type            scalarSemiImplicitSource;
    active          yes;

    scalarSemiImplicitSourceCoeffs
    {
            
        selectionMode   cellZone;
        cellZone        sourceZone;
        volumeMode      specific;
        injectionRateSuSp
        {
            h      (100000000 0); // J/m3/s
        }
    }
}

porosity
{
	type explicitPorositySource;
	active yes;

    explicitPorositySourceCoeffs
    {
	selectionMode  cellZone;
	cellZone       sourceZone;
        type           DarcyForchheimer; //Source in momentum equation is -(mu*d*U + f*(rho*U^2)/2)

        DarcyForchheimerCoeffs
        {
            //approx 1 mm spheres
            d   d [0 -2 0 0 0 0 0] (1e9 1e9 1e9);
            f   f [0 -1 0 0 0 0 0] (34150 34150 34150);

            coordinateSystem
            {
                type    cartesian;
                origin  (0 0 0);
                coordinateRotation
                {
                    type    axesRotation;
                    e1  (1 0 0);
                    e2  (0 1 0);
                    e3  (0 0 1);
                }
            }
        }
    }
}

// ************************************************************************* //
